Tekla Open API Reference for Tekla Structures 2025
GraphicsDrawer Methods
The GraphicsDrawer type exposes the following members.
Methods
Name | Description
DrawLineSegment(LineSegment, Color)
 Draws a temporary line segment in the currently active rendered view.
DrawLineSegment(Point, Point, Color)
 Draws a temporary line segment in the currently active rendered view.
DrawMeshLines
 Draws the mesh lines as temporary graphics in the currently active Tekla Structures rendered view.
DrawMeshSurface
 Draws the mesh surface as temporary graphics in the currently active Tekla Structures rendered view. The counterclockwise sides of the mesh triangles are drawn.
DrawPolyLine
 Draw a temporary polyline into all open Tekla Structures views.
DrawText
 Draws a temporary text in the currently active rendered view.
DrawTextToView
 Draws a temporary text to the specified view. You can set the view Identifier.ID = 0 for current active view.
RemoveTemporaryGraphicsObject
 Remove a temporary graphic object from all views.
RemoveTemporaryGraphicsObjects
 Remove a list of temporary graphic objects from all views.
Top
See Also
Reference
GraphicsDrawer Class
Tekla.Structures.Model.UI Namespace